package 复习;

// 4月13 做:T38 写:  看:
// 4月14 做:T39 写:T34F T1F T35F  看:T37 T38
// 4月15 做:T39 写:T33F T34 T1  看:T35 T38 T36
// 4月16 做:T40 写:  看: 
// 4月17 做:T41 T42 写:T36F T37F  看: T39 T40
// 4月18 做: 写:  看:T36 T41 T42
// 4月19 做:T43 T44 写:  看:
// 4月20 做:T45 写:  看:
// 4月21 做:T46 写:T40F T36F T41F   看: T42 T38
// 4月22 做:T47 写:  看:T46 T42 T43 T44 T45
// 4月23 做:T48 T49 写:T46F  看:
// 4月24 做:T50 写:T36 T38 T40F T41F 看 :T48 T49
// 4月25 做:T51 写:T44F T45F  看:
// 4月26 做:T52 写:T46 T47 T48看:T51 
// 4月27 做:T53 写:T50F  看:
// 4月28 做:T136 写:  看:
// 4月29 做: 写:  看:
// 4月30 做:T54 写:  看:
// 5月1  做:T55 写:T40 T41 T43F T44看: T42
// 5月2  做:T56 写:T46 T48 T49F T50F 看:
// 5月3  做:T57 写:  看: T53 T54 T55 T56 T57
// 5月4  做:T58 写:T49 T50F T51F T52 T53F T54F 看:
// 5月5  做:T59 写:T55F T56 T57F  看:
// 5月6  做:T60 写:T58F T43 看:
// 5月7  做:T61 写:  看:
// 5月8  做:T62 写:T53 T50 T51 看:
// 5月9  做:T63 写:T54F  看:
// 5月10 做:T64 写:T55F T57F 看:
// 5月11  做:T65 写:T58	 看:
// 5月12 做:T66 写:  看:T65 T64
// 5月13 做:T67 写:T60F 看:
// 5月14 做:T68 写: 看:
// 5月15 做:T69 写: T63 T64F T65F 看:
// 5月16 做:T70 写: 看:
// 5月17 做:T71 写:T66F T67F 看:
// 5月18 做:L53 写: 看:
// 5月19 做:L121 写:T68F T69F T70 T71 看:
// 5月20 做:L122 写: 看:L53 L121
// 5月21 做:L123 写: 看:L122 T45 T54 T60
// 5月22 做:L62 写: 看:
// 5月23  做:L63	 写: 看:T64 65 66 67
// 5月24 做:L198 写: 看:L62 L63 L70 L123
// 5月25 做:L338 L96写: L121F L53F看:
// 5月26 做:L64 写:L122 L123 看:L338 
// 5月27 做:Rodcutting 写:看:
// 5月28 做:L53 写:L62 L63F L198 看:Rodcutting T12
// 5月29 做:L152 写:L338看:
// 5月30 做:L309 写:看:
// 5月31 做:L448 写:看:
// 6月1  做: 写:L152看:L63 L64 L121 L122 L123 L53
// 6月2  做:L104 L24 写:T12 R L448 L309看:
// 6月3  做:L110 写:看:L104 L24
// 6月4  做:L111 L226 写:T12 M看:L110 L101
// 6月5  做:L617  写:L24 看:L111 L226         9号完成计网前六章的粗读 × 160/350
// 6月6  做:L654 写:L110 L101 看:L617 
// 6月7  做:L83 写:看:L654
// 6月8  做:L206 写:看:
// 6月9  做:L783 写:看:L206  
// 6月10 做:L102 写:看:    操作系统Lab✘✔     DFS与BFS √   计网粗读    6
// 6月11 做:L22 写:L24F L654 L83 看:L102 T12    计网20
// 6月12 做:L200 写:L783 L617 看:L22    看csapp 60   计网 201/350
// 6月13 做:L695 写:L102 L206F看:L200 L83  csapp108  计网209
// 6月14 做:L130 写: 看: csapp121  计网231
// 6月15 做:L127 写: 看: csapp130  计网   
// 6月16 做:L83 写:L24 L22F看:L206 csapp136  http详解24   无向图最短路径√   7天看完csapp第三章
// 6月17 做:L207 写: 看: csapp149  http详解  54
// 6月18 做:迪节斯卡尔 写: 看:L207 L127 csapp156  http详解  76
// 6月19 做:L1  写: 看:L207 L127 csapp174  http详解  78
// 6月20 做:L2 写:L200 L695 L130F 看: csapp180  http详解  76
// 6月21 做:L19 写:L127F 看:L1 L2 csapp190  http详解  76
// 6月22 做:L61 写 看:csapp198  http详解  76
// 6月23 做:L206 写 看:L61 L19  csapp216 7天第三章√  http详解  162
// 6月24 做:L3 写: 看: csapp  http  
// 6月25 做:L11 写: 看: csapp  http
// 6月26 做:L15 写: 看: csapp  http 
// 6月27 做:L16 写: 看:L83 csapp  http看完√         5天看完csapp第四章√
// 6月28 做:L26 写:L2F L19 看: csapp248 计网细读               5天看完计网应用层√
// 6月29 做:L209 写:L61F L206 看:L26 csapp269 计网细读  
// 6月30 做:L141 写:L3F L11 L26F 看:L209 csapp269 计网细读  
// 7月1  做:L202 写: 看:L141 csapp  计网细读
// 7月2  做:L876 写: 看: csapp第四章√  计网细读
// 7月3  做:L56写: 看:L141 L202 L876 csapp  计网细读 √   看面筋√
// 7月4  做:LL6写: 看:       颓废（游戏7小时）
// 7月5  做:L14写:L141F 看:     完成计网入门√与HTTP× wireshark 实验  3天看完csapp第6章×  4/3
// 7月6  做:L763写:看:     完成计网HTTP与DNS wireshark 实验√  
// 7月7  做:L7写:L141 L202看:     计网运输层8天看完√ 
// 7月8  做:？写:看:L7  
// 7月9  做:L8 写:看:  
// 7月10 做:L9 写:L56F L6F看:  L7 L8
// 7月11 做:L43 写:L763看:    牛客时间复杂度题目20道×
// 7月12 做:L172 写: 看:L43 L8 L7    B站时间复杂度视频√
// 7月13  做:L258 写: 看:        2天看完csapp第7章√	
// 7月14  做:L54  写:L43F 看:        	
// 7月15  做: L73 写:  看:        	起床不玩电子产品的 第1天；
// 7月16  做:L945  写: 看: L73 L54 L258 L172       	起床不玩电子产品的 第2天；
// 7月17  做:L20  写:L56F L6  看:        	起床不玩电子产品的 第3天；
// 7月18  做:L155  写:L172  看:        	起床不玩电子产品的 第4天； 计网UDP、TCP实验
// 7月19  做:L150 写:L 看:        	起床不玩电子产品的 第5天；
// 7月20  做:L739 写:L 看:        	起床不玩电子产品的 第6天；  java正则×   计网4天完成数据平面× 4/7 csapp4天完成异常控制流× 4/8
// 7月21  做:L215 写:L945 L20 看:        	起床不玩电子产品的 第7天；
// 7月22  做:L347写:L看:        	起床不玩电子产品的 第8天；
// 7月23  做:L236写:L看:        	起床不玩电子产品的 第9天；
// 7月24  做:L23写:L看:        	  起床不玩电子产品的 第10天；
// 7月25  做:L写:L看:        	颓废    起床不玩电子产品的 第11天；
// 7月26  做:L687写:L739F L251看:l56        	起床不玩电子产品的 第12天；
// 7月27  做:L33写:L看:        	    起床不玩电子产品的 第13天；
// 7月28  做:L34写:L看:L33 L687     	    起床不玩电子产品的 第14天；  
// 7月29  做:L94写:L看:   	    起床不玩电子产品的 第15天；   
// 7月30  做:L102写:L看:   	    起床不玩电子产品的 第16天；   看完codesheep的项目实操视频
// 7月31  做:L110写:L236看:   	    起床不玩电子产品的 第17天；   
// 8月1   做:L144写:L看:   	    起床不玩电子产品的 第18天；   
// 8月2   做:L145 L450写:L看:   	    起床不玩电子产品的 第19天；    计网4天完成控制平面
// 8月3  做:L98 L701 写:L34F L35F看:   	    起床不玩电子产品的 第20天；  csapp7天完成虚拟内存 √
// 8月4  做:L46写:L94 L145 L98看:   	    起床不玩电子产品的 第21天；   
// 8月5  做:L51写:L23F 看:   	       
// 8月6  做:L22写:L98F L450F看: L51 L46	       
// 8月7 做:L78写:L701F看:          总结面筋
// 8月8 做:L39写: 看:          
// 8月9 做:L40写:L51F 看:        redis  
// 8月10做:L47写:L22 L78 看:        
// 8月11做:L写: 看:      考试考试     
// 考试考试     
// 8月19做:L3 L12写: 看:       开始一天两道LeetCode
// 8月20做:L5 L11写: 看:       
// 8月21做:L15 L17写: 看:       
// 8月22做:L19 L21写: 看:       
// 8月23做:L31 L33写: 看:        
// 复习考试
//8月28做:L48 L写: 看:
//8月29 颓废
//8月30做:L53 L写: 看:
//返校
//9月4做:写:L48 L49 L53 看:  
//9月5做:L56 L62 L64 写:L55 看:   看完计网的Guided√
//9月6做L70 L75: 写: 看:   
//9月7做:L78 L79 写: 看:   
//9月8做:L94 L79 写: 看:   2
//9月9做:L96 L98 写:L75 看:    弄懂B+ B- B* 树√  背完http相关√  背完数据结构相关×
//9月10做:L101 L102 写: 看:   	弄懂KMP算法√  例题10+ 
//9月11做:L105 L114写: 看:     java基础26
//9月12做:写: 看:     完成java基础√  操作系统
//9月13做:L141 L142写: 看:     复习
//9月14做:L148 L146写:L94 L79 看:      复习背出来
//9月15做:L152 L160写:L101看:     
//9月17做:L169写:看:     开始21！！！！！
//9月18做:L198 L200 L206写:看:      2.3多线程 - 2.3.10 √ 完成虚拟内存 4.1.1 -4.1.10 √
//9月19做:L207 L208写:看:     复习昨天的√   把现代上的线程看了× 2.3.11-15× 4.1.11-15× 创建java多线程 × 
//9月20做:L234 L写:看:     复习   索引 √  现代上的线程√ 创建java多线程√  4.1.11-15√
//9月21做:L236写:L142 L152看:     复习√    4.1.剩下的  2.3.11-15
//9月22做:剑指6道写:看:     复习mysql√ 物化作业√ 数据库学习√
//9月23做:写:看:     复习mysql× redis×
//9月24做:写:看:     ×
//9月25做:剑指4道写:看:      复习mysql√ redis4.2.5√
//9月26做:写:看:      复习mysql√ 
//9月28做:剑指6道 写:看:      复习mysql redis4.2. 
//  牛客上的时间复杂度题目   正则解决L8 和剑指上的题
//  复习mysql  早上起来看面筋
